abstract class AuthState {}//Бул класс
class AuthInitial extends AuthState {} //тынчтык.
//Бул тиркеме жаңы эле ачылгандагы абал.
//Экранда: Колдонуучу логин-пароль киргизе элек, баракча бош турат.
class AuthLoading extends AuthState {} //иштөө процесси.
//Колдонуучу "Кирүү" баскычын баскан учур.
//Экранда: Бул абал иштегенде, экранда тегерекче айланып (CircularProgressIndicator) 
//калышы керек. Бул колдонуучуга "күтө туруңуз, маалымат текшерилип жатат" деген белги берет.
class AuthSuccess extends AuthState {} //жеңиш!
//Логин жана пароль туура келген учур.
//Экранда: Программа бул абалды көргөндө, колдонуучуну кийинки (мисалы, Башкы) 
//бетке автоматтык түрдө өткөрөт.
//Эскертүү: Сиздин кодуңузда AuthSucces деп жазылыптыр, адатта AuthSuccess (эки "s" менен) деп жазылат. 
//Бул ката эмес, бирок Cubit файлында да дал ушундай жазылганын текшериңиз.
class AuthError extends AuthState { //ката бар.
//Логин ката же интернет жок болгон учур.
//final String message: Бул жерде катанын тексти сакталат (мисалы: "Сыр сөз туура эмес").
//Экранда: UI бул абалды алганда, экрандын ылдый жагына же ортосуна кызыл жазуу менен катаны чыгарып берет.
   final String message;
 AuthError(this.message);
}